[
  {
    "image": "https://i.ibb.co.com/0ygFyCSx/gpt.png",
    "title": "ChatGPT",
    "companyName": "OpenAI",
    "id": 1,
    "description": "ChatGPT is a generative artificial intelligence chatbot developed by OpenAI and released in 2022. It currently uses GPT-5, a generative pre-trained transformer (GPT), to generate text, speech, and images in response to user prompts.[3][4] It is credited with accelerating the AI boom, an ongoing period marked by rapid investment and public attention toward the field of artificial intelligence (AI).[5] OpenAI operates the service on a freemium model. Users can interact with ChatGPT through text, audio, and image prompts.  By January 2023, ChatGPT had become the fastest-growing consumer software application in history, gaining over 100 million users in two months.[6][7] As of 2025, ChatGPT's website is among the 5 most-visited websites globally,[8][9] and has over 700 million active weekly users.[10] It has been lauded as a revolutionary tool that could transform numerous professional fields. At the same time, its release prompted extensive media coverage and public debate about the nature of creativity and the future of knowledge work.  Despite its acclaim, the chatbot has been criticized for its limitations and potential for unethical use. It can generate plausible-sounding but incorrect or nonsensical answers known as hallucinations. Biases in its training data have been reflected in its responses. The chatbot can facilitate academic dishonesty, generate misinformation, and create malicious code. The ethics of its development, particularly the use of copyrighted content as training data, have also drawn controversy. These issues have led to its use being restricted in some workplaces and educational institutions and have prompted widespread calls for the regulation of artificial intelligence",
    "size": 152000000,
    "reviews": 3300000,
    "ratingAvg": 4.8,
    "downloads": 54000000,
    "ratings": [
      { "name": "1 star", "count": 22000 },
      { "name": "2 star", "count": 16000 },
      { "name": "3 star", "count": 55000 },
      { "name": "4 star", "count": 260000 },
      { "name": "5 star", "count": 2820000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/whYXrHz8/image.png",
    "title": "TikTok",
    "companyName": "ByteDance",
    "id": 2,
    "description": "TikTok, known in mainland China and Hong Kong[3] as Douyin (Chinese: 抖音; pinyin: Dǒuyīn; lit. 'Shaking Sound'),[4] is a social media and short-form online video platform owned by Chinese Internet company ByteDance. It hosts user-submitted videos, which range in duration from three seconds to 60 minutes.[5] It can be accessed through a mobile app or through its website.   Since its launch, TikTok has become one of the world's most popular social media platforms, using recommendation algorithms to connect content creators and influencers with new audiences.[6] In April 2020, TikTok surpassed two billion mobile downloads worldwide.[7] Cloudflare ranked TikTok the most popular website of 2021, surpassing Google.[8] The popularity of TikTok has allowed viral trends in food, fashion, and music to take off and increase the platform's cultural impact worldwide.[9][10]    TikTok has come under scrutiny due to data privacy violations, mental health concerns, misinformation, offensive content, and its role during the Gaza war.[11][12] While TikTok remains accessible to users in most countries, a minority of countries (including India and Afghanistan) have implemented full or partial bans. Many other countries limit TikTok's use on government-issued devices for security or privacy reasons",
    "size": 225000000,
    "reviews": 2900000,
    "ratingAvg": 4.7,
    "downloads": 40000000,
    "ratings": [
      { "name": "1 star", "count": 32000 },
      { "name": "2 star", "count": 21000 },
      { "name": "3 star", "count": 62000 },
      { "name": "4 star", "count": 310000 },
      { "name": "5 star", "count": 2360000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ynFrMTbn/image.png",
    "title": "Instagram",
    "companyName": "Meta",
    "id": 3,
    "description": "Instagram[a] is an American photo and short-form video sharing social networking service owned by Meta Platforms. It allows users to upload media that can be edited with filters, be organized by hashtags, and be associated with a location via geographical tagging. Posts can be shared publicly or with preapproved followers. Users can browse other users' content by tags and locations, view trending content, like photos, and follow other users to add their content to a personal feed.[8] A Meta-operated image-centric social media platform, it is available on iOS, Android, Windows 10, and the web. Users can take photos and edit them using built-in filters and other tools, then share them on other social media platforms like Facebook. It supports 33 languages including English, Hindi, Spanish, French, Japanese, and Korean.[9] Instagram was originally distinguished by allowing content to be framed only in a square (1:1) aspect ratio of 640 pixels to match the display width of the iPhone at the time. In 2015, this restriction was eased with an increase to 1080 pixels. It also added messaging features, the ability to include multiple images or videos in a single post, and a Stories feature—similar to its main competitor, Snapchat, which allowed users to post their content to a sequential feed, with each post accessible to others for 24 hours. As of January 2019, Stories was used by 500 million people daily.[8]  Instagram was launched for iOS in October 2010 by Kevin Systrom and the Brazilian software engineer Mike Krieger. It rapidly gained popularity, reaching 1 million registered users in two months, 10 million in a year, and 1 billion in June 2018. In April 2012, Facebook acquired the service for approximately US$1 billion in cash and stock. The Android version of Instagram was released in April 2012, followed by a feature-limited desktop interface in November 2012, a Fire OS app in June 2014, an app for Windows 10 in October 2016, and an app for iPadOS in September 2025. Although often admired for its success and influence, Instagram has also been criticized for negatively affecting teens' mental health, its policy and interface changes, its alleged censorship, and illegal and inappropriate content uploaded by users",
    "size": 185000000,
    "reviews": 2650000,
    "ratingAvg": 4.6,
    "downloads": 38500000,
    "ratings": [
      { "name": "1 star", "count": 26000 },
      { "name": "2 star", "count": 21000 },
      { "name": "3 star", "count": 52000 },
      { "name": "4 star", "count": 285000 },
      { "name": "5 star", "count": 2220000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/r2J4KXdp/image.png",
    "title": "WhatsApp",
    "companyName": "Meta",
    "id": 4,
    "description": "WhatsApp (officially WhatsApp Messenger), owned by Meta Platforms, is an American social media, instant messaging (IM), and Voice over IP (VoIP) service accessible via desktop and mobile app.[13][14] It allows users to send text messages, voice messages, and video messages,[15] make voice and video calls, and share images, documents, user locations, and other content.[16][17] The service requires a cellular mobile telephone number to register.[18] WhatsApp was launched in February 2009. In January 2018, WhatsApp released a standalone business app called WhatsApp Business which can communicate with the standard WhatsApp client.[19][20] As of May 2025, the service had 3 billion monthly active users, making it the most used messenger app.[21] The name of the app is meant to sound like what's up .The service was created by WhatsApp Inc. of Mountain View, California, which was acquired by Facebook in February 2014 for approximately US$19.3 billion.[22][23] It became the world's most popular messaging application in 2015, with 900 million users,[14][24] and had more than 2 billion active users worldwide in February 2020.[25] WhatsApp Business had approximately 200 million monthly users in 2023.[26] By 2016, it had become the primary means of Internet communication in regions including the Americas, the Indian subcontinent, and large parts of Europe and Africa",
    "size": 125000000,
    "reviews": 3050000,
    "ratingAvg": 4.5,
    "downloads": 27500000,
    "ratings": [
      { "name": "1 star", "count": 42000 },
      { "name": "2 star", "count": 31000 },
      { "name": "3 star", "count": 72000 },
      { "name": "4 star", "count": 355000 },
      { "name": "5 star", "count": 2510000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/d0kppHnQ/facebook.png",
    "title": "Facebook",
    "companyName": "Meta",
    "id": 5,
    "description": "Facebook is an American social media and social networking service owned by the American technology conglomerate Meta. Created in 2004 by Mark Zuckerberg with four other Harvard College students and roommates, Eduardo Saverin, Andrew McCollum, Dustin Moskovitz, and Chris Hughes, its name derives from the face book directories often given to American university students. Membership was initially limited to Harvard students, gradually expanding to other North American universities.  Since 2006, Facebook allows everyone to register from 13 years old, except in the case of a handful of nations, where the age requirement is 14 years.[6] As of December 2023, Facebook claimed almost 3.07 billion monthly active users worldwide.[7] As of July 2025, Facebook ranked as the third-most-visited website in the world, with 23% of its traffic coming from the United States.[8] It was the most downloaded mobile app of the 2010s.[9]  Facebook can be accessed from devices with Internet connectivity, such as personal computers, tablets and smartphones. After registering, users can create a profile revealing personal information about themselves. They can post text, photos and multimedia which are shared with any other users who have agreed to be their friend or, with different privacy settings, publicly. Users can also communicate directly with each other with Messenger, edit messages (within 15 minutes after sending),[10][11] join common-interest groups, and receive notifications on the activities of their Facebook friends and the pages they follow.Facebook has often been criticized over issues such as user privacy (as with the Facebook–Cambridge Analytica data scandal), political manipulation (as with the 2016 U.S. elections) and mass surveillance.[12] The company has also been subject to criticism over its psychological effects such as addiction and low self-esteem, and over content such as fake news, conspiracy theories, copyright infringement, and hate speech.[13] Commentators have accused Facebook of willingly facilitating the spread of such content, as well as exaggerating its number of users to appeal to advertisers",
    "size": 202000000,
    "reviews": 2550000,
    "ratingAvg": 4.4,
    "downloads": 30500000,
    "ratings": [
      { "name": "1 star", "count": 51000 },
      { "name": "2 star", "count": 41000 },
      { "name": "3 star", "count": 82000 },
      { "name": "4 star", "count": 325000 },
      { "name": "5 star", "count": 2060000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/4RNQQNYX/telegram.png",
    "title": "Telegram",
    "companyName": "Telegram FZ‑LLC",
    "id": 6,
    "description": "Telegram (also known as Telegram Messenger) is a cloud-based, cross-platform social media and instant messaging (IM) service. It launched for iOS on 14 August 2013 and Android on 20 October 2013. It allows users to exchange messages, share media and files, and hold private and group voice or video calls as well as public livestreams. It is available for Android, iOS, Windows, macOS, Linux, and web browsers. Telegram offers end-to-end encryption in voice and video calls,[7] and optionally in private chats if both participants use a mobile device. Telegram also has social networking features, allowing users to post stories, create large public groups with up to 200,000 members, or share one-way updates to unlimited audiences in so-called channels.[8] Telegram was founded in 2013 by Nikolai and Pavel Durov.[9][10] Its servers are distributed worldwide with several data centers, while the headquarters are in Dubai, United Arab Emirates.[11][12] It was the most downloaded app worldwide in January 2021,[13][14] with 1 billion downloads globally as of late August 2021. As of 2024, registration to Telegram requires either a phone number and a smartphone or one of a limited number of non-fungible tokens (NFTs) issued in December 2022.[15] As of March 2025, Telegram has more than 1 billion monthly active users,[16] with India as the country with the most users",
    "size": 95000000,
    "reviews": 1850000,
    "ratingAvg": 4.7,
    "downloads": 20500000,
    "ratings": [
      { "name": "1 star", "count": 16000 },
      { "name": "2 star", "count": 11000 },
      { "name": "3 star", "count": 42000 },
      { "name": "4 star", "count": 205000 },
      { "name": "5 star", "count": 1530000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/FkK8BZpb/snapchat.png",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 7,
    "description": "Snapchat is an American multimedia social media and instant messaging app and service developed by Snap Inc., originally Snapchat Inc. One of the principal features of the app are that pictures and messages, known as snaps, are usually available for only a short time before they become inaccessible to their recipients. The app has evolved from originally focusing on person-to-person photo sharing to presently featuring users' Stories of 24 hours of chronological content, along with Discover, letting brands show ad-supported short-form content. It also allows users to store photos in a password-protected area called My Eyes Only. It has also reportedly incorporated limited use of end-to-end encryption, with plans to broaden its use in the future. Snapchat was created by Evan Spiegel, Bobby Murphy, and Reggie Brown,[6] former students at Stanford University. It is known for representing a mobile-first direction for social media, and places significant emphasis on users interacting with virtual stickers and augmented reality objects. In 2023, Snapchat had over 300 million monthly active users.[7] On average more than four billion Snaps were sent each day in 2020.[8] Snapchat is popular among the younger generations, with most users being between 18 and 24.[7] Snapchat is subject to privacy concerns with social networking services.",
    "size": 165000000,
    "reviews": 1450000,
    "ratingAvg": 4.3,
    "downloads": 20200000,
    "ratings": [
      { "name": "1 star", "count": 31000 },
      { "name": "2 star", "count": 21000 },
      { "name": "3 star", "count": 52000 },
      { "name": "4 star", "count": 255000 },
      { "name": "5 star", "count": 1090000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/pvZQ74y4/image.pngg",
    "title": "Telegram X",
    "companyName": "Telegram FZ‑LLC",
    "id": 8,
    "description": "Telegram X (also known as Telegram Messenger) is a cloud-based, cross-platform social media and instant messaging (IM) service. It launched for iOS on 14 August 2013 and Android on 20 October 2013. It allows users to exchange messages, share media and files, and hold private and group voice or video calls as well as public livestreams. It is available for Android, iOS, Windows, macOS, Linux, and web browsers. Telegram offers end-to-end encryption in voice and video calls,[7] and optionally in private chats if both participants use a mobile device. Telegram also has social networking features, allowing users to post stories, create large public groups with up to 200,000 members, or share one-way updates to unlimited audiences in so-called channels.[8] Telegram was founded in 2013 by Nikolai and Pavel Durov.[9][10] Its servers are distributed worldwide with several data centers, while the headquarters are in Dubai, United Arab Emirates.[11][12] It was the most downloaded app worldwide in January 2021,[13][14] with 1 billion downloads globally as of late August 2021. As of 2024, registration to Telegram requires either a phone number and a smartphone or one of a limited number of non-fungible tokens (NFTs) issued in December 2022.[15] As of March 2025, Telegram has more than 1 billion monthly active users,[16] with India as the country with the most users",
    "size": 90000000,
    "reviews": 420000,
    "ratingAvg": 4.5,
    "downloads": 5200000,
    "ratings": [
      { "name": "1 star", "count": 5200 },
      { "name": "2 star", "count": 3100 },
      { "name": "3 star", "count": 11000 },
      { "name": "4 star", "count": 41000 },
      { "name": "5 star", "count": 336000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/2xc7d7P/capcut.png",
    "title": "CapCut",
    "companyName": "Bytedance Pte. Ltd.",
    "id": 9,
    "description": "Video editing tool for short videos",
    "size": 215000000,
    "reviews": 1250000,
    "ratingAvg": 4.6,
    "downloads": 23500000,
    "ratings": [
      { "name": "1 star", "count": 21000 },
      { "name": "2 star", "count": 16000 },
      { "name": "3 star", "count": 31000 },
      { "name": "4 star", "count": 205000 },
      { "name": "5 star", "count": 910000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Lh5yzF47/youtube.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 10,
    "description": "Video streaming & sharing platform",
    "size": 190000000,
    "reviews": 3100000,
    "ratingAvg": 4.7,
    "downloads": 45000000,
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 60000 },
      { "name": "4 star", "count": 320000 },
      { "name": "5 star", "count": 2750000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/RkWbTDH8/spotify.png",
    "title": "Spotify",
    "companyName": "Spotify Ltd.",
    "id": 11,
    "description": "Music streaming & podcasts",
    "size": 170000000,
    "reviews": 1950000,
    "ratingAvg": 4.6,
    "downloads": 28000000,
    "ratings": [
      { "name": "1 star", "count": 18000 },
      { "name": "2 star", "count": 14000 },
      { "name": "3 star", "count": 45000 },
      { "name": "4 star", "count": 210000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/tpmwgxWB/image.png",
    "title": "Twitter",
    "companyName": "X Corp.",
    "id": 12,
    "description": "Social news & microblogging platform",
    "size": 115000000,
    "reviews": 1750000,
    "ratingAvg": 4.4,
    "downloads": 26000000,
    "ratings": [
      { "name": "1 star", "count": 22000 },
      { "name": "2 star", "count": 17000 },
      { "name": "3 star", "count": 48000 },
      { "name": "4 star", "count": 240000 },
      { "name": "5 star", "count": 1450000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/tpF7h5xz/image.png",
    "title": "LinkedIn",
    "companyName": "Microsoft",
    "id": 13,
    "description": "Professional networking platform",
    "size": 130000000,
    "reviews": 900000,
    "ratingAvg": 4.5,
    "downloads": 14000000,
    "ratings": [
      { "name": "1 star", "count": 9000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 15000 },
      { "name": "4 star", "count": 60000 },
      { "name": "5 star", "count": 800000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ccK7w941/slack.png",
    "title": "Slack",
    "companyName": "Slack Technologies",
    "id": 14,
    "description": "Team communication & collaboration tool",
    "size": 140000000,
    "reviews": 850000,
    "ratingAvg": 4.3,
    "downloads": 12000000,
    "ratings": [
      { "name": "1 star", "count": 11000 },
      { "name": "2 star", "count": 9000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 70000 },
      { "name": "5 star", "count": 740000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/d4yL8kNX/image.png",
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "id": 15,
    "description": "Video conferencing & collaboration",
    "size": 165000000,
    "reviews": 1000000,
    "ratingAvg": 4.4,
    "downloads": 15000000,
    "ratings": [
      { "name": "1 star", "count": 12000 },
      { "name": "2 star", "count": 9000 },
      { "name": "3 star", "count": 25000 },
      { "name": "4 star", "count": 95000 },
      { "name": "5 star", "count": 840000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/XZ90W1BN/smteam.png",
    "title": "Microsoft Teams",
    "companyName": "Microsoft",
    "id": 16,
    "description": "Team chat, calls, meetings",
    "size": 155000000,
    "reviews": 920000,
    "ratingAvg": 4.3,
    "downloads": 13000000,
    "ratings": [
      { "name": "1 star", "count": 13000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 23000 },
      { "name": "4 star", "count": 80000 },
      { "name": "5 star", "count": 790000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/d4qPQHZN/image.png",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 17,
    "description": "Email & messaging service",
    "size": 125000000,
    "reviews": 1100000,
    "ratingAvg": 4.5,
    "downloads": 18000000,
    "ratings": [
      { "name": "1 star", "count": 14000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 30000 },
      { "name": "4 star", "count": 80000 },
      { "name": "5 star", "count": 1000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/YTb1LkP5/image.png",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 18,
    "description": "Navigation & maps service",
    "size": 145000000,
    "reviews": 1300000,
    "ratingAvg": 4.6,
    "downloads": 22000000,
    "ratings": [
      { "name": "1 star", "count": 16000 },
      { "name": "2 star", "count": 12000 },
      { "name": "3 star", "count": 35000 },
      { "name": "4 star", "count": 110000 },
      { "name": "5 star", "count": 1170000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/0VsLq5wy/image.png",
    "title": "Dropbox",
    "companyName": "Dropbox, Inc.",
    "id": 19,
    "description": "Cloud file storage & sharing",
    "size": 135000000,
    "reviews": 580000,
    "ratingAvg": 4.4,
    "downloads": 9000000,
    "ratings": [
      { "name": "1 star", "count": 8000 },
      { "name": "2 star", "count": 7000 },
      { "name": "3 star", "count": 16000 },
      { "name": "4 star", "count": 50000 },
      { "name": "5 star", "count": 500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Mb14HQw/pinterest.png",
    "title": "Pinterest",
    "companyName": "Pinterest, Inc.",
    "id": 20,
    "description": "Image sharing & visual discovery",
    "size": 120000000,
    "reviews": 670000,
    "ratingAvg": 4.5,
    "downloads": 11000000,
    "ratings": [
      { "name": "1 star", "count": 9000 },
      { "name": "2 star", "count": 7000 },
      { "name": "3 star", "count": 18000 },
      { "name": "4 star", "count": 45000 },
      { "name": "5 star", "count": 580000 }
    ]
  }
]
